{"class_name": "Model", "keras_version": "2.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 35], "name": "input_8", "sparse": false}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_547", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "dense_547"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_548", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_547", 0, 0, {}]]], "name": "dense_548"}], "input_layers": [["input_8", 0, 0]], "output_layers": [["dense_548", 0, 0]], "name": "model_rbfs"}, "backend": "theano"}