{"class_name": "Model", "keras_version": "2.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5], "name": "input_13", "sparse": false}, "inbound_nodes": [], "name": "input_13"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_559", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]], "name": "dense_559"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_560", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_559", 0, 0, {}]]], "name": "dense_560"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_561", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_560", 0, 0, {}]]], "name": "dense_561"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAAAgAAAEMAAABzDQAAAHQAAGoBAHwAAIMBAFMoAQAAAE4oAgAAAHQBAAAAS3QDAAAA\nYWJzKAEAAAB0AQAAAHgoAAAAACgAAAAAcyAAAAA8aXB5dGhvbi1pbnB1dC0yMjktZDkyOTUyYTlj\nMmYzPnQIAAAAPGxhbWJkYT4GAAAAcwAAAAA=\n", null, null], "name": "lambda_297", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [1], "output_shape_type": "raw"}, "inbound_nodes": [[["dense_561", 0, 0, {}]]], "name": "lambda_297"}], "input_layers": [["input_13", 0, 0]], "output_layers": [["lambda_297", 0, 0]], "name": "model_7"}, "backend": "theano"}