{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_11", "sparse": false}, "inbound_nodes": [], "name": "input_11"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_101", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_101"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_103", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_103"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_105", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_105"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_107", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_107"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_109", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_109"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_102", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_101", 0, 0, {}]]], "name": "dense_102"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_104", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_103", 0, 0, {}]]], "name": "dense_104"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_106", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_105", 0, 0, {}]]], "name": "dense_106"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_108", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_107", 0, 0, {}]]], "name": "dense_108"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_110", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_109", 0, 0, {}]]], "name": "dense_110"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_15", "axis": -1}, "inbound_nodes": [[["dense_102", 0, 0, {}], ["dense_104", 0, 0, {}], ["dense_106", 0, 0, {}], ["dense_108", 0, 0, {}], ["dense_110", 0, 0, {}]]], "name": "concatenate_15"}], "input_layers": [["input_11", 0, 0]], "output_layers": [["concatenate_15", 0, 0]], "name": "model_amps"}, "backend": "theano"}