{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_11", "sparse": false}, "inbound_nodes": [], "name": "input_11"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_111", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_111"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_113", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_113"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_115", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_115"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_117", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_117"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_119", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_119"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_112", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_111", 0, 0, {}]]], "name": "dense_112"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_114", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_113", 0, 0, {}]]], "name": "dense_114"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_116", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_115", 0, 0, {}]]], "name": "dense_116"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_118", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_117", 0, 0, {}]]], "name": "dense_118"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_120", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_119", 0, 0, {}]]], "name": "dense_120"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_16", "axis": -1}, "inbound_nodes": [[["dense_112", 0, 0, {}], ["dense_114", 0, 0, {}], ["dense_116", 0, 0, {}], ["dense_118", 0, 0, {}], ["dense_120", 0, 0, {}]]], "name": "concatenate_16"}], "input_layers": [["input_11", 0, 0]], "output_layers": [["concatenate_16", 0, 0]], "name": "model_efas"}, "backend": "theano"}