{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_11", "sparse": false}, "inbound_nodes": [], "name": "input_11"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_91", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_91"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_93", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_93"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_95", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_95"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_97", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_97"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_99", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_99"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_92", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_91", 0, 0, {}]]], "name": "dense_92"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_94", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_93", 0, 0, {}]]], "name": "dense_94"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_96", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_95", 0, 0, {}]]], "name": "dense_96"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_98", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_97", 0, 0, {}]]], "name": "dense_98"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "dense_100", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_99", 0, 0, {}]]], "name": "dense_100"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_14", "axis": -1}, "inbound_nodes": [[["dense_92", 0, 0, {}], ["dense_94", 0, 0, {}], ["dense_96", 0, 0, {}], ["dense_98", 0, 0, {}], ["dense_100", 0, 0, {}]]], "name": "concatenate_14"}], "input_layers": [["input_11", 0, 0]], "output_layers": [["concatenate_14", 0, 0]], "name": "model_cnts"}, "backend": "theano"}