{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5], "name": "input_12", "sparse": false}, "inbound_nodes": [], "name": "input_12"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s\u0019\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000t\u0002\u0000\u0083\u0001\u0002S(\u0004\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000t\b\u0000\u0000\u0000keepdims(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000sumt\u0004\u0000\u0000\u0000True(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s+\u0000\u0000\u0000../regression/code/functional_fit_helper.pyt\b\u0000\u0000\u0000<lambda>A\u0000\u0000\u0000t\u0000\u0000\u0000\u0000", null, null], "name": "rbfs_sum", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_12", 0, 0, {}]]], "name": "rbfs_sum"}], "input_layers": [["input_12", 0, 0]], "output_layers": [["rbfs_sum", 0, 0]], "name": "model_rbfs"}, "backend": "theano"}